[
  {
    "Title": "Logan \u0026 Willow - The book",
    "Views": 0,
    "Excerpt": "This year my wife and I felt the need to work on a shared project.  What could be better than a projet about our son?  \nSo we came out with this crazy idea of writing a *children\u0027s book*.\n\nTake a look at the story of **Logan and Willow**!\n",
    "CoverImagePath": null,
    "Public": true,
    "State": 0,
    "PublicationDate": "2020-11-25T00:00:00+01:00",
    "Updates": [],
    "Id": "b0cff91f-f85d-4438-bccc-708924dde6ec",
    "Created": "2020-11-25T21:24:58.392+01:00",
    "Updated": "2020-11-25T21:24:58.392+01:00",
    "Slug": "loganwillow",
    "Stars": 0,
    "Deleted": false
  },
  {
    "Title": "Cooking With Logan",
    "Views": 0,
    "Excerpt": "There are many ways to spend your time. But what I think is one of the best: *familly time*.  \nThat should definitively \u003Cu\u003Enot\u003C/u\u003E stop you from doing something else also.\n\nAs I *love* my son, and as I love cooking, what should I do? Well do both obviously!  \nThat\u0027s how **Cooking With Logan** was born: I wanted to enjoy spending time with him and take time to cook. I wanted to share some stuff I can do with my 2 years old son at cooking.!",
    "CoverImagePath": null,
    "Public": true,
    "State": 0,
    "PublicationDate": "2020-11-25T00:00:00+01:00",
    "Updates": [],
    "Id": "e5cbd844-08c4-421f-ac85-721a6e39e2d3",
    "Created": "2020-11-25T21:32:39.105+01:00",
    "Updated": "2020-11-25T21:32:39.105+01:00",
    "Slug": "cwl",
    "Stars": 0,
    "Deleted": false
  },
  {
    "Title": "triggan",
    "Views": 0,
    "Excerpt": "This starts to look like a mise en abyme.  \nAnyway, here you might find stuff regard this specific website.\n\nThe updates will cover functionalities and else. But let\u0027s be honest it\u0027s mostly interesting if you\u0027re interested in .NET or related development stuff!",
    "CoverImagePath": null,
    "Public": true,
    "State": 0,
    "PublicationDate": "2020-11-25T00:00:00+01:00",
    "Updates": [
      {
        "Title": "Finally a functionning website!",
        "Content": "After spending very little time on creating this website during October 2020, I quickly stumbled upon issues.\n\nThe website itself was good too me but... choosing .NET 5 while in preview blocked a few things. I wasn\u0027t able to publish anything usable! Getting from unusable feature such as Azure Functions, a DAL which wouldn\u0027t run on various host (allowing only previous .NET versions) or some very expensives ideas (Azure Functions cumulate almost all the issues).\n\nBut in the end I found it! I found a way to make it work. The actuall website [triggan.com](https://www.triggan.com) is a static blazor website, using two json files as \u0022database\u0022.\n\nWhen I want to update stuff, I run the server version locally (which I should fully deploy to avoid the need to run VS each time). The server app possess git feature. When I save stuff, it commits and push to a publication branch, which triggers github actions and TADA!\n\nThis update is actually the final test...\n\n_Hourray!_",
        "Created": "2021-01-13T22:49:00.214+01:00",
        "PublicationDate": "2021-01-13T22:49:00.214+01:00"
      }
    ],
    "Id": "8f136252-6e21-4e1a-86e9-1c916f9fc04d",
    "Created": "2020-11-25T21:38:31.661+01:00",
    "Updated": "2021-01-13T22:58:42.3931678+01:00",
    "Slug": "triggan",
    "Stars": 0,
    "Deleted": false
  },
  {
    "Title": "Poudr\u0027a Patate",
    "Views": 0,
    "Excerpt": "My first card game! It all comes from a night out with some friends and trying not that interesting ideas with standard cards.\n\nThen, I ended up creating first fules of a card game bases on **potatoes**.\n\nAnd after a few years, here we are, with a fully (badly) designed game!",
    "CoverImagePath": null,
    "Public": true,
    "State": 0,
    "PublicationDate": "2020-11-25T00:00:00+01:00",
    "Updates": [],
    "Id": "7abab4bd-6833-4be7-ab38-1fbdf34ea3b2",
    "Created": "2020-11-25T21:45:36.657+01:00",
    "Updated": "2020-11-25T21:45:36.657+01:00",
    "Slug": "poudrapatate",
    "Stars": 0,
    "Deleted": false
  }
]