[
  {
    "Title": "Energy management",
    "Views": 0,
    "Content": "I\u0027ve recently been hearing Tim Ferriss talking a few times about how he went from focusing on time management to energy management last year.\n\nI must admit that this resonated quite a lot in my head. My son has *so much* more energy than my wife and I do. And these days I cannot seem to handle any type of schedule outside of work meetings.\n\n\nBut then there is the energy. When your time is limited (it always is), you need to use it wisely.\nThen why are you watching that Netflix show you don\u0027t like that much when you could start writing on the book you have been thinking about for so long?\nWhy are you eating that bag of chips when you could easily cook some delicious healthy meal for the week?\n\nMaybe you will tell yourself and others you don\u0027t have the motivation to do so. but we all know that motivation isn\u0027t reliable. If you want to stick to your plans, you need the energy to fight your inner lazy self. So think just a little bit about how to have more energy.\n\nAfter that, get to work and show us what you can do!",
    "Excerpt": "Is there a point managing anything if you lack the energy to move forward?",
    "CoverImagePath": "",
    "Public": true,
    "Type": 0,
    "PublicationDate": "2020-11-24T00:00:00+01:00",
    "Tags": [],
    "Created": "2020-11-24T16:48:31.035+01:00",
    "Updated": "2021-03-01T11:34:28.6873582+01:00",
    "Slug": "energy",
    "Stars": 2,
    "Deleted": false
  },
  {
    "Title": "Getting back to being the driver",
    "Views": 0,
    "Content": "There are lots of people who said it before me: motivation is a lie. You cannot be motivated all the time, it is not reliable. What it means is you need to create systems and habits that will make you keep working on what matters to you, no matter what.\n\nYou can however have various level of motivation. We are not talking about the feeling only here. Maybe you are lost. You have been driving a lot in so many directions, but now you don\u0027t know anymore.\n\nWhere are you going? Where is going that big project of yours?\n\nIt\u0027s pretty hard to find any actually working systems to help you work in this case because you are starting to doubt the core goals of what you do. And it can be very impacting on your mood and most probably other parts of your life if you are lost.\n\nSo what to do? Let\u0027s get inspired by Tony Robbins. There is a part in is book \u0022Awaken the Giant Within\u0022 discussing the need to be able to switch your state. For example, when I walk my dog, I usually get my inner peace back pretty much instantly.\nBut if you don\u0027t know where you go, changing your emotional state won\u0027t necessarily make you the driver of your life again.\n\nThen use it just like the motivation: at a higher level. Maybe you need to spend a week at your family\u0027s house. Maybe you would change your mind after a few days alone in the mountains to reflect on your life. Even a adrenaline-fuled activity like parchute jumping or a flight in a fighter aircraft can totally change your situation by being so much more than your usal emotion changers.\n\nWhat you just need to think about is what will work for you. I avoided reading some self development and productivity books recently because I was thinking it wouldn\u0027t be useful right now, until I know again where I go.\nUntil recently when I noticed that reading The 4 Hour Work week is EXACTLY how I can know where I go.\n\nNow, let\u0027s drive again, we\u0027ve got a long road to do.",
    "Excerpt": "What should you do when you lost your motivation?\nWhat should you do when you don\u0027t know where you go?",
    "CoverImagePath": null,
    "Public": true,
    "Type": 0,
    "PublicationDate": "2021-03-11T00:00:00+01:00",
    "Tags": null,
    "Created": "2021-03-11T12:18:16.329+01:00",
    "Updated": "2021-03-11T12:18:16.329+01:00",
    "Slug": "driver",
    "Stars": 0,
    "Deleted": false
  },
  {
    "Title": "How was your week?",
    "Views": 0,
    "Content": "I learnt about Ryan Hildebrandt\u0027s habit called the [weekly review](http://ryanhildebrandt.com/weekly-review/) in 2018.\nThough I didn\u0027t do as many crazy stuff as he had since, I can clearly tell this is a habit worth trying.\n\nThere are _many_ habits you can find to help you improved your life, productivity, health and so on. I won\u0027t lie to you, not every one of them will be useful for you. Sometimes you can even come across utterly useless methods.\n\nSo what I\u0027m discussing here is just something I tried.\nThe weekly review is just something really simple to help you take a step back from the events of your life. As you go through a list of questions to view your last week with positivity and in an __improvement focused__ mindset, you will find yourself enjoying more the days that you are checking. You will see more ways to improve rather than just \u0022bad\u0022 behaviors your might have had.\n\nAs a software engineer, I can\u0027t help but to think of it as the agile method \u0022sprint retrospective\u0022 adapted weekly to your life.\n\n\nI am currently working on an application called [Last Week](http://localhost:6593/project/lw) to help me fill the reviews, check it out!\n\n\nAnd if you try the habit, in any way, please share it, I would love to discuss!",
    "Excerpt": "Do you know how was your last week?\nA review can sometimes be useful!",
    "CoverImagePath": null,
    "Public": true,
    "Type": 0,
    "PublicationDate": "2021-05-11T00:00:00+02:00",
    "Tags": null,
    "Created": "2021-05-11T11:21:18.067+02:00",
    "Updated": "2021-05-11T11:21:18.067+02:00",
    "Slug": "weekly",
    "Stars": 0,
    "Deleted": false
  },
  {
    "Title": "The instant change and lasting change",
    "Views": 0,
    "Content": "In the 7\u003Csup\u003Eth\u003C/sup\u003E chapter of [*Awaken the Giant Within*](https://www.amazon.com/Awaken-Giant-Within-Immediate-Emotional/dp/0671791540), Anthony Robbins talks about emotions.\n\nOne part really got stuck in my mind: instant change.\\\nHe offers to list ways to change immediately how your feel. For example taking jacuzzi or a warm bath, hugging your children, there might be quite a lot of ways and we are all different.\\\nI, for instance, would put taking freezing cold shower in this list.\n\nIt can be very **powerful** to know your own list and embrace it. If you find yourself having trouble to work because you feel down, or angry at something, then you use one of these ways to get better and do what you settled to do!\n\nBut what if your down feeling comes back later that day? Or the next day? And the day after?\n\nInstant change is most of the time not a lasting solution. It\u0027s easy and efficient to get out of a bad state of mind when it\u0027s coming from short term events. Your boss decided she prefers the cheap solution for this specific customer you won\u0027t be working with anymore starting tomorrow? **Ok, go run a few miles and get back to whatever you have to do**.\\\nBut then your she decides that, despite having proven its benefit on your own work, remote working is now forbidden? This might be huge for your life. You should still take that action, eat your favorite burger, make love, just to clear your mind. But it won\u0027t change the feeling as the effects are lasting.\n\nThen, except from rare really breathtaking events, instant change is not the solution. You have to dig into the issue to actually see what to do.\n\nFeeling bad at work is not something your just need to change every time it happens. You need long term vision.\\\nFeeling tired everyday won\u0027t be solve just by power naps. You need to review what is depleting your energy.\n\n*Instant change is good, just use it wisely.*",
    "Excerpt": "Sometimes people quit bad habits like smoking overnight. Some will get back to it. Some won\u0027t. How to know the difference?",
    "CoverImagePath": null,
    "Public": true,
    "Type": 0,
    "PublicationDate": "2021-05-31T00:00:00+02:00",
    "Tags": null,
    "Created": "2021-05-31T11:35:33.61+02:00",
    "Updated": "2021-05-31T11:35:33.61+02:00",
    "Slug": "change",
    "Stars": 0,
    "Deleted": false
  }
]